{"pages":[{"title":"about","text":"","link":"/about/index.html"},{"title":"categories","text":"","link":"/categories/index.html"},{"title":"tags","text":"","link":"/tags/index.html"}],"posts":[{"title":"Make my own blog step by step","text":"To have a website customized for own use seems a common thought of every programmer. I have tried Gridea before and recently found Hexo a highly free tool to make a website. Strengths of Hexo are like: With an active community Plenty of shared themes and requiring very little coding skills Providing very clear tutorials for beginners to use Hexo Can be deployed to your own server or other code-hosting servers like GitHub. Easily writing contents using Markdown syntax So here are steps to build a website hosted on GitHub, to be specific, on MacOS. Roadmap​ 1234567891011121314151617181920212223242526272829flowchart LR; subgraph Installation A0[Node.js] C0[Hexo] B0[Git] D0[Markdown editor] end subgraph &quot;Build locally&quot; A0 &amp; C0 --&gt;A1(Set up) --&gt;A2(Design) --&gt;A3(Preview) D0 --&gt;A2 end subgraph &quot;Deploy to a server(or a hosting website)&quot; B0 &amp; A3 --&gt;B1(Link GitHub and local hexo folder) --&gt;B2(Deploy) end e&gt;Plz try to click the nodes!] click A0 &quot;https://nodejs.org/en&quot; click C0 &quot;https://hexo.io/docs/&quot; click B0 &quot;https://git-scm.com/download/&quot; InstallationPlease follow the instructions on official websites of each tool. Node.js Hexo Briefly, in terminal.app, run: npm install hexo-cli -g Or if familiar with npm then please run: npm install hexo Git Any Markdown Editor: Typora(strongly recommended), Obssidian, VSCode…… Build locallySet upDesignPreview","link":"/2023/03/23/Make-my-own-blog-step-by-step-on-MacOS/"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2023/03/23/hello-world/"}],"tags":[{"name":"hexo","slug":"hexo","link":"/tags/hexo/"},{"name":"GitHub","slug":"GitHub","link":"/tags/GitHub/"},{"name":"blog","slug":"blog","link":"/tags/blog/"}],"categories":[]}